NKQC/maimai-input-control-firmware/psoc_firmware/CY8C4147AZI-SensorCore/main.c
/* 统计 64 位掩码里的置位数(APPLY 的脏通道工作量)。 */
static inline uint32_t _popcount64(uint64_t v)
{
    uint32_t n = 0u;
    while (v != 0u) { v &= (v - 1u); n++; }
    return n;
}
/* 实时触控帧：主循环每个 capsense 周期更新，DMA 完成 ISR 作为默认响应装入 TX FIFO（流水线）。 */
static volatile uint8_t touch_frame[SENSOR_FRAME_SIZE];
/* APPLY 指令置位，主循环执行重校准（不能在 ISR 里做耗时重扫描）。 */
static volatile bool apply_pending = false;
/* 硬件参数改变后仅记录对应通道，避免 APPLY 为未修改通道重校准造成状态漂移。 */
static volatile uint64_t idac_dirty_mask = 0u;
/* MEASURE_CP 指令置位，主循环执行逐电极 BIST 电容测量(不能在 ISR 里做耗时测量)。 */
static volatile bool measure_cp_pending = false;
/* SET_GLOBAL 置位：全局 CSD 配置(inactive_sns/IDAC/MFS)改动需完整 Init+Enable 重初始化才能
 * 重算内部预计算(csdInactiveSnsDm/HSIOM 见 cy_capsense_sensing.c)。轻量 APPLY 不够，会坏扫描。
 * 主循环执行与启动同序的 Cy_CapSense_Init+Enable(已验证可用)。 */
static volatile bool global_apply_pending = false;
/* 主循环测量期间保持 true；SPI ISR 据 pending/active 返回 0，避免读到半更新数组。 */
static volatile bool measure_cp_active = false;
/* CALIBRATE 指令置位：主循环执行真正的 IDAC 重校准 CalibrateAllWidgets(不能在 ISR 里做)。 */
static volatile bool calibrate_pending = false;
/* BASELINE_RESET 指令置位：主循环执行 InitializeAllBaselines 重置全部通道基线。 */
static volatile bool baseline_reset_pending = false;
/* AUTO_TUNE 指令置位：主循环执行频率自适应下探(逐档升 snsClk 分频重校准)。 */
static volatile bool auto_tune_pending = false;
/* 自适应结果: 0=未执行/进行中, 1=成功(auto_tune_div 为找到的分频), 2=失败(超硬件上限仍压不到目标)。 */
static volatile uint8_t auto_tune_result = 0u;
/* 自适应成功时找到的 snsClk 分频(已写回目标 widgetContext)。
 * ★全通道(0xFF)模式的完成态语义★: 各通道分频互不相同, 单一分频无意义, 故完成时本字段 = 成功通道数
 * (0..36); 真正的逐通道分频由 RP2040 完成后经 GET_PARAM(0x08) 逐通道回读写穿真相源。 */
static volatile uint16_t auto_tune_div = 0u;
/* 本次自适应的目标通道: 0..35=单通道, AUTO_TUNE_CH_ALL=全通道。GET_AUTO_TUNE 回显该字节。 */
static volatile uint8_t auto_tune_ch = AUTO_TUNE_CH_ALL;
/* 本次自适应的灵敏度偏好档位(1..7, 默认 4=居中): 落档时在临界分频上加 2*(pref-1)(往低频=更灵敏)。 */
static volatile uint8_t auto_tune_pref = 4u;
/* ★阶段性进度★: 长自适应(最坏 ~20s)期间由主循环逐步更新, 经 GET_AUTO_TUNE 的 progress 字节上报,
 * 使 RP2040/上位机在过程中就能看到"到哪一步了", 而非只能干等最终结果。
 * phase: 0=空闲/已受理 1=粗定位 2=细搜临界 3=落档/回退 4=完成; step: 该阶段内步序(1 起, 上报饱和 31)。
 * SPI 是独立中断且优先级(2)高于 CapSense(3), 故校准阻塞期间 ISR 仍能应答这两个量。 */
static volatile uint8_t auto_tune_phase = 0u;
static volatile uint8_t auto_tune_step = 0u;
#define AUTO_TUNE_PHASE_IDLE             (0u)
#define AUTO_TUNE_PHASE_COARSE           (1u)
#define AUTO_TUNE_PHASE_FINE             (2u)
#define AUTO_TUNE_PHASE_SETTLE           (3u)
#define AUTO_TUNE_PHASE_DONE             (4u)
#define AUTO_TUNE_STEP_MAX_REPORT        (31u)
/* 细搜(1 步进上探临界)最大步数: 粗表最大相邻间隔为 48→64 的 16, 取 15 步即可覆盖整个区间;
 * 同时限制全通道模式下额外校准次数(单次全通道校准 ~200-270ms), 保证总耗时留在 RP2040 的 10s 窗内。 */
#define AUTO_TUNE_FINE_STEPS_MAX         (15u)
/* ★处理中锁定/真实完成反馈★：ISR 收到 APPLY/CALIBRATE/BASELINE_RESET/GLOBAL_COMMIT 即置 1,
 * 主循环把对应重操作真正做完后清 0。经 GET_STATS 响应 byte[2] 上报, 供 RP2040 轮询至真实完成
 * (替代原固定 sleep 盲等), 上位机据此显示"处理中"并在真正完成后解锁/刷新, 而非命令一到就误判完成。 */
static volatile uint8_t g_op_busy = 0u;
/* 任一通道的 JIT 算法【显式请求点灯】(io->out_led != 0)。白 LED 的唯一运行时来源。
 * 固件不再从触控判定(out_active)推导灯态 —— 没有算法、或算法不写 out_led 时白灯恒灭。 */
static volatile bool g_any_active = false;
/* 全局"是否自动校准"运行时开关(GPARAM_AUTO_CALIBRATE_EN, 默认开)。开=Init/Apply 走 Enable 自动校准 IDAC;
 * 关=只 Initialize+基线复位, 用固定 IDAC(配置/手动值)换取稳定灵敏度范围(修某些通道自动校准发散 railed)。
 * "校准"命令(SENSOR_CMD_CALIBRATE)始终执行一次显式校准, 不受本开关影响(满足"点校准=单次校准"需求)。 */
static volatile bool g_auto_calibrate = true;
/* 每通道最近一次寄生电容测量值(fF)，0xFFFFFF=失败/未测量。 */
static volatile uint32_t cp_value[SENSOR_CHANNEL_COUNT];
/* CSD 处理模式：SCAN_MODE_AUTO(自动校准/标准完整处理) / SCAN_MODE_SEMI(半自动手动)。 */
static volatile uint8_t scan_mode = SCAN_MODE_AUTO;
static volatile uint32_t scan_count = 0u;  // 每完成一次全通道扫描 +1，自由递增(无触摸也增长)
static uint8_t snapshot_buffers[2u][SENSOR_SNAPSHOT_SIZE];
static uint16_t snapshot_generations[2u];
static volatile uint8_t published_snapshot_index;
static volatile bool published_snapshot_valid;
static uint8_t transfer_snapshot[SENSOR_SNAPSHOT_SIZE];
static uint16_t transfer_generation;
static bool transfer_valid;

/* ---- JIT 可加载触控算法引擎（ABI v1，见 psoc_algo_abi.h）----
 * algo_slot：可执行 1KB RAM 槽，4 字节对齐（Cortex-M0+ 从 SRAM 取指，thumb 入口 |1）。
 * algo_staging：ALGO_PAGE 写入的暂存区；ALGO_END 只置 pending，由主循环校验 CRC16 后 commit。 */
static uint8_t algo_slot[ALGO_SLOT_SIZE] __attribute__((aligned(4)));
static uint8_t algo_staging[ALGO_SLOT_SIZE];
static volatile bool algo_valid = false;
static volatile uint16_t algo_len = 0u;
/* ALGO_BEGIN 声明的期望长度；ALGO_PAGE 越界保护用。 */
static volatile uint16_t algo_expected_len = 0u;
/* 主循环 commit 状态机：ISR 只置位，真正的 CRC 校验 + memcpy 由主循环执行。 */
static volatile bool algo_commit_pending = false;
static volatile uint16_t algo_commit_crc = 0u;
/* 逐通道持久 IO 记录：状态字段跨周期原地保留，仅输入字段每周期刷新。 */
static algo_io_t g_algo_io[SENSOR_CHANNEL_COUNT];
/* 记录上一周期各通道 base_active，用于检测非激活→激活边沿以清零 state[]。 */
static uint8_t algo_prev_active[SENSOR_CHANNEL_COUNT];
/* 每通道 16 位 ROM：上位机随算法下发的只读常量(如 per-channel fingerCap/Cp/阈值)，
 * 每周期填入 io->rom 供算法读取。算法不写。ALGO_SET_ROM/GET_ROM 读写。 */
static volatile uint16_t g_algo_rom[SENSOR_CHANNEL_COUNT];
/* 共享算法可设置变量(ABI cfg[8]): 上位机经 ALGO_SET_CFG 下发, 每次算法执行前拷入 io->cfg。
 * 供算法运行时可调参数(如基线偏移、阈值系数等), 上位机按源码声明的名字+默认值展示为可调项。 */
static volatile uint8_t g_algo_cfg[8] = {0u};
/* 毫秒计时：SysTick 每 1ms 回调递增。真实 ms 源，见 systick_ms_callback()。 */
static volatile uint32_t g_ms_tick = 0u;

/* 全局 CSD 配置 RAM 影子：生成的 cy_capsense_commonConfig 是 const(flash)不可运行时改，
 * 故 init 前把它拷到 RAM 并把 cy_capsense_context.ptrCommonConfig 指向此副本；
 * 之后 SET_GLOBAL 改此副本、APPLY 重初始化时中间件从 ptrCommonConfig 重算内部预计算而生效。 */
static cy_stc_capsense_common_config_t g_common_cfg_ram;
/* 启动时固件强制改写过哪些生成配置项(位掩码, 经 GPARAM_BOOT_OVERRIDE 只读上报)。
 * 有值即说明"设备实际配置 != 用户/生成配置给的值", 上位机必须据此告警, 不许静默不同步。 */
static uint8_t g_boot_override = 0u;

static void spi_slave_task(uint8_t rx_index);
static void spi_dma_isr(void);
static void spi_cs_isr(void);
static void spi_dma_init(void);
static void spi_dma_arm_tx(void);
static void spi_snapshot_latch_task(void);

static void capsense_isr(void)
{
    Cy_CapSense_InterruptHandler(CYBSP_CSD_HW, &cy_capsense_context);
}

/* SysTick 1ms 回调：唯一的 g_ms_tick 写者，运行时真实毫秒时间戳来源。 */
static void systick_ms_callback(void)
{
    g_ms_tick++;
}

static void initialize_ms_tick(void)
{
    /* SysTick 用 CPU 时钟，1ms 周期：reload = SystemCoreClock/1000 - 1。 */
    uint32_t reload = (SystemCoreClock / 1000u);
    if (reload > 0u) { reload -= 1u; }
    Cy_SysTick_Init(CY_SYSTICK_CLOCK_SOURCE_CLK_CPU, reload);
    (void)Cy_SysTick_SetCallback(0u, systick_ms_callback);
}

