NKQC/maimai-input-control-firmware/psoc_firmware/CY8C4147AZI-SensorCore/main.c
                algo_commit_pending = false;
                len = algo_expected_len;
                crc_expect = algo_commit_crc;
                crc_calc = algo_crc16(algo_staging, len);

                if (crc_calc == crc_expect)
                {
                    memcpy(algo_slot, algo_staging, ALGO_SLOT_SIZE);
                    algo_len = len;
                    algo_valid = true;
                }
                /* CRC 不一致：拒绝，algo_valid 保持旧值不变。 */
            }

            /* 全局 CSD 配置改动：完整 Init+Enable 重初始化(与启动同序),重算 inactive_sns/IDAC/MFS
             * 的内部预计算。轻量 APPLY 不重算 → 会坏扫描,故全局改动必须走此完整路径。 */
            if (global_apply_pending)
            {
                spi_dbg.stage = MLOOP_STAGE_GLOBAL_APPLY;
                global_apply_pending = false;
                /* 全局配置变更应用: Init 从 ptrCommonConfig(RAM 影子)重算内部预计算
                 * (含 csdInactiveSnsDm/HSIOM), Enable 校准+基线+首扫。
                 * ★不再调 Cy_CapSense_DeInit★: 实测运行时 DeInit→Init→Enable 会把扫描速率从 ~180Hz
                 * 掉到 ~15Hz(疑似 DeInit 未复位时钟分频, 再 Init 残留慢时钟); 仅 Init→Enable 同样重算
                 * 全局预计算且保持满速。 */
                /* Init 会从 ROM 生成配置重铺 widgetContext, 打掉当前生效的 resolution/snsClk
                 * (启动归一的 32, 或用户 SET_PARAM / AUTO_TUNE 的逐通道值) → 见 _widget_hw_save 注释。 */
                _widget_hw_save();
                (void)Cy_CapSense_Init(&cy_capsense_context);
                _widget_hw_restore();
                /* Init 会按 ptrCommonConfig 重铺 widgetContext 增益档 → 先把用户锁定值写回,
                 * 再由紧随其后的 Initialize 一并下到硬件(不额外触发校准)。 */
                (void)_idac_lock_restore();
                /* ★配置更新只重算内部预计算, 不再自动校准/频率下探(转一圈)★:
                 * 恒走轻量 Initialize+基线路径, 沿用现有(上次手动校准的)IDAC。
                 * Enable 的自动校准(SmartSense 可含频率自适应)耗时长会阻塞→掉 USB, 且用户要求
                 * "频率自适应探测只能手动触发"。故校准/频率下探仅由显式 CALIBRATE / AUTO_TUNE 命令触发,
                 * 配置改动(inactive_sns/IDAC/MFS)本身即时生效但不重扫校准。 */
                (void)Cy_CapSense_Initialize(&cy_capsense_context);
                Cy_CapSense_InitializeAllBaselines(&cy_capsense_context);
            }

            /* APPLY 指令：在主循环(非 ISR)重新初始化扫描硬件使硬件参数(分辨率/时钟/IDAC)生效。 */
            if (apply_pending)
            {
                const uint32_t apply_t0 = g_ms_tick;
                spi_dbg.stage = MLOOP_STAGE_APPLY;

                apply_pending = false;
                if (scan_mode == SCAN_MODE_AUTO && g_auto_calibrate)
                {
                    /* 自动校准开：重新启用 CapSense(含 IDAC 自动校准)，后续继续标准完整处理。 */
                    spi_dbg.stage = MLOOP_STAGE_APPLY_ENABLE;
                    (void)Cy_CapSense_Enable(&cy_capsense_context);
                    idac_dirty_mask = 0u;
                    _idac_lock_reapply();   /* Enable 的自动校准会把增益档冲回起点档 */
                }
                else
                {
                    /* 硬件参数变化会使旧 IDAC 不再适用，只在用户允许自动校准时修复被改通道；
                     * 关闭自动校准表示用户要求固定 IDAC，脏位保留到其重新允许校准。 */
                    if (g_auto_calibrate)
                    {
                        spi_dbg.stage = MLOOP_STAGE_APPLY_RECAL;
                        _recalibrate_dirty_channels();
                    }
                    /* 从 widgetContext 重配硬件并重置基线，保留手动阈值与手动硬件参数。 */
                    spi_dbg.stage = MLOOP_STAGE_APPLY_INIT;
                    (void)Cy_CapSense_Initialize(&cy_capsense_context);
                    spi_dbg.stage = MLOOP_STAGE_APPLY_BASELINE;
                    Cy_CapSense_InitializeAllBaselines(&cy_capsense_context);
                }
                (void)apply_t0;
            }

            /* CALIBRATE：真正的 IDAC 重校准(把 raw 拉回目标, 修 railed), 再复位基线。
             * 与 APPLY 区分——APPLY 只重配/re-init, 不重算 IDAC; 半自动手动下"校准"必须走这里
             * 才有效(否则 raw 一直卡满量程 diff=0)。CalibrateAllWidgets 需校准使能。 */
            if (calibrate_pending)
            {
                spi_dbg.stage = MLOOP_STAGE_CALIBRATE;
                calibrate_pending = false;
#if (defined(CY_CAPSENSE_CSD_CALIBRATION_EN) && (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSD_CALIBRATION_EN))
                /* ★逐通道校准, 不用 CalibrateAllWidgets★
                 * CalibrateAllWidgets 对全部 widget 一律用【全局起点增益档】csdIdacGainInitIndex,
                 * 而本面板 36 段的 Cp 跨度极大(实测 ch8≈22pF、ch35≈138pF), 各通道的 IDAC 增益档
                 * 本就不该相同 —— 用户逐通道设过的档位记在 g_idac_lock 里, 被它统一按全局档校准后
                 * 等于全部作废(高 Cp 通道压不下来仍 railed, 低 Cp 通道又过冲)。
                 * 故与 _recalibrate_dirty_channels() 同口径: 逐通道调用 _calibrate_widget_locked(),
                 * 它会在校准该通道时临时把全局起点档替换为该通道自己的锁定档, 校准完还原。
                 * 未锁定的通道行为不变(仍用全局档)。 */
                for (uint32_t cal_ch = 0u; cal_ch < SENSOR_CHANNEL_COUNT; cal_ch++)
                {
                    (void)_calibrate_widget_locked(cal_ch);
                }
#else
                (void)Cy_CapSense_Enable(&cy_capsense_context);
#endif
                /* 校准无条件把增益档拉回起点档 → 恢复用户锁定档并重配硬件(不再校准), 否则
                 * "手动设的增幅一点校准就没了"。 */
                if (_idac_lock_restore())
                {
                    (void)Cy_CapSense_Initialize(&cy_capsense_context);
                }
                Cy_CapSense_InitializeAllBaselines(&cy_capsense_context);
            }

            /* BASELINE_RESET：仅把全部通道基线重置到当前 raw(消除历史漂移), 不动 IDAC/参数。 */
            if (baseline_reset_pending)
            {
                spi_dbg.stage = MLOOP_STAGE_BASELINE_RESET;
                baseline_reset_pending = false;
                Cy_CapSense_InitializeAllBaselines(&cy_capsense_context);
            }

            /* AUTO_TUNE：频率自适应下探。高 Cp 电极在高频(小分频)下传感器来不及建立→IDAC 无论如何
             * 都压不到目标%→CalibrateWidget 返回非 SUCCESS。此处从高频起逐档升分频(降频),
             * 每档重校准, 用中间件校准返回状态判定该频率下 IDAC 能否满足目标; 首个成功的分频即为
             * "满足当前 IDAC 设置的最高频率(最快扫描)", 写回该 widgetContext 并记录; 全部档位都失败
             * = 超该通道硬件能力 → 该通道失败。运行时可调, 结果经 GET_AUTO_TUNE 上报。 */
            /* 通道 Cp 跨度极大(22pF~138pF), 单一统一分频无法兼顾 → 两种模式都按【单通道】判定:
             *   auto_tune_ch = 0..35: 只改该 widget 的 snsClk(其余通道不动), CalibrateWidget 判定;
             *   auto_tune_ch = 0xFF : 逐通道各自校准——外层遍历 36 通道, 每通道独立跑完整三步算法,
             *                         各得其自身分频; 不再要求"全通道共用同一分频且全部通过"。 */
            if (auto_tune_pending)
            {
                spi_dbg.stage = MLOOP_STAGE_AUTO_TUNE;
                const uint8_t target_ch = auto_tune_ch;
                const uint8_t pref = auto_tune_pref;
                uint16_t final_div = 0u;
                bool tuned = false;
                auto_tune_pending = false;

                if (target_ch < SENSOR_CHANNEL_COUNT)
                {
                    tuned = auto_tune_run_ch(target_ch, pref, &final_div);
                }
                else
                {
                    /* 逐通道各自校准: 单通道失败不拖垮全场, 只影响该通道(其分频保持上一次的值)。
                     * 进度期间 auto_tune_ch 回显"当前正在处理的通道", 供上位机显示 CHn/36。 */
                    uint32_t ok_count = 0u;
                    uint32_t w;
                    for (w = 0u; w < SENSOR_CHANNEL_COUNT; w++)
                    {
                        uint16_t ch_div = 0u;
                        auto_tune_ch = (uint8_t)w;
                        if (auto_tune_run_ch((uint8_t)w, pref, &ch_div)) ok_count++;
                    }
                    auto_tune_ch = AUTO_TUNE_CH_ALL;      /* 终态回显请求语义(全通道) */
                    final_div = (uint16_t)ok_count;       /* 完成态: div 字段 = 成功通道数 */
                    tuned = (ok_count > 0u);
                }

                /* 自适应内部逐档 CalibrateWidget 同样会把增益档冲回起点档: 搜索过程按中间件口径
                 * 进行(不干扰判定), 终态再把用户锁定档恢复并重配硬件。 */
                if (_idac_lock_restore())
                {
                    (void)Cy_CapSense_Initialize(&cy_capsense_context);
                }
                /* 基线复位只在最终分频确定后做一次。 */
                Cy_CapSense_InitializeAllBaselines(&cy_capsense_context);
                auto_tune_div = tuned ? final_div : 0u;   /* 失败: div 无效(否则残留最后一次试探值) */
                auto_tune_phase = AUTO_TUNE_PHASE_DONE;
                auto_tune_step  = 0u;
                auto_tune_result = tuned ? 1u : 2u;       /* 1=成功(至少一个通道) 2=全部失败 */
            }

            /* ★处理中锁定解除★：本轮已把入队的重操作全部做完(且未被 ISR 追加新的)→ 清 busy。
             * RP2040 轮询 GET_STATS 的 busy 字节由 1→0 即判定该重操作真实完成(替代盲等 sleep)。 */
            if (!apply_pending && !calibrate_pending && !baseline_reset_pending &&
                !global_apply_pending && !auto_tune_pending)
            {
                g_op_busy = 0u;
            }

            scan_count++;
            /* 带外 SWD 可读的存活证据: 扫描计数。 */
            spi_dbg.scan_count_m = scan_count;
            spi_dbg.stage = MLOOP_STAGE_SCAN_START;
            Cy_CapSense_ScanAllWidgets(&cy_capsense_context);
        }
    }
}

/* [] END OF FILE */
